---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralFloorCoreThickness
source: html/9cecd18a-cf97-2821-2a7a-ba0a3b098e9e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralFloorCoreThickness Property

"Core Thickness"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralFloorCoreThickness { get; }
```